{
  "minBudget": 500000,
  "maxBudget": 800000,
  "primaryLocation": "",
  "secondaryLocation": "",
  "transitTargets": {
    "primary": 45,
    "secondary": 60
  },
  "theme": "dark",
  "categories": [],
  "locations": {
    "primary": {
      "name": "619 Doncaster Road, Doncaster",
      "lat": -37.7773,
      "lng": 145.1373
    },
    "secondary": {
      "name": "Rye Pier",
      "lat": -38.3781,
      "lng": 144.8228
    }
  },
  "strategyExplanations": {
    "investment": {
      "title": "Investment Strategy (Lower Budget Range)",
      "description": "When you're buying at the lower end of your mortgage budget, you're making a strategic choice. You're okay with a lower-priced house because you won't be there long - instead, you want maximum growth in value to get ahead of pricing for your following house. This strategy optimizes scoring weightings for capital growth and rental yield.",
      "behavior": "Buyers in this range prioritize growth over lifestyle because they're planning to upgrade. They want their property to appreciate faster so they can build equity and move up the property ladder sooner.",
      "weightings": {
        "investment": "30-45% (highest)",
        "location": "30-35%",
        "accessibility": "15-20%",
        "lifestyle": "10-20% (lower)",
        "community": "10-15%"
      },
      "example": "A suburb with 5% growth and 4% rental yield scores significantly higher under Investment strategy because growth metrics receive 35% weight (vs 20% in Balanced). This helps you find suburbs where your property will appreciate faster, giving you more equity to upgrade."
    },
    "balanced": {
      "title": "Balanced Strategy (Middle Budget Range)",
      "description": "When you're buying in the middle of your mortgage budget, you want both growth potential and quality of life. This strategy provides equal consideration of investment potential and lifestyle factors - the sweet spot for most Melbourne buyers who want their property to appreciate while also being a wonderful place to live.",
      "behavior": "Buyers in this range are balancing financial goals with lifestyle needs. They want their property to grow in value AND provide a great living experience. They're not planning to move as quickly as Investment buyers, but they still want growth.",
      "weightings": {
        "investment": "30-35% (balanced)",
        "location": "30-35% (balanced)",
        "accessibility": "15-20%",
        "lifestyle": "10-20% (balanced)",
        "community": "10-15%"
      },
      "example": "A suburb with moderate growth (3%), good schools (75 rating), and decent transport scores well under Balanced strategy because all factors receive similar weight. This helps you find suburbs that offer the best of both worlds - growth potential AND quality of life."
    },
    "lifestyle": {
      "title": "Lifestyle Strategy (Higher Budget Range)",
      "description": "When you're buying at the higher end of your mortgage budget, you're making a lifestyle choice. You're willing to pay more because the home and area are amazing and worth it to you. You care less about investment growth because you plan to live in that great home for longer. This strategy optimizes scoring weightings for quality of life factors.",
      "behavior": "Buyers in this range prioritize lifestyle over growth because they're planning to stay longer. They want an exceptional place to live, even if growth potential is moderate. The home itself is the investment in their quality of life.",
      "weightings": {
        "investment": "18-25% (lower)",
        "location": "23-30%",
        "accessibility": "20-26%",
        "lifestyle": "15-30% (highest)",
        "community": "10-19%"
      },
      "example": "A suburb with top-rated schools (90+ rating) and abundant parks (5+ per km²) scores significantly higher under Lifestyle strategy because lifestyle metrics receive 25% weight (vs 15% in Balanced). This helps you find suburbs where you'll love living long-term, even if growth isn't the highest."
    }
  }
}